### Question 1

--Question: Select all numeric columns except float from the DataFrame `dft`.

Answer:

In [29]:
import pandas as pd

In [70]:
import numpy as np

In [54]:
data = {'col1': [1, 2, 3], 'col2': ['A', 'B', 'C'], 'col3':[4.0, 5.5,6.6]}
dft = pd.DataFrame(data)
dft

   col1 col2  col3
0     1    A   4.0
1     2    B   5.5
2     3    C   6.6

In [31]:
dft.select_dtypes(include=['number'], exclude=['float'])

   col1
0     1
1     2
2     3

### Question 2

Question: How do you return the last 3 rows of a DataFrame `df`?

Answer:

```

In [55]:
df = dft
df

   col1 col2  col3
0     1    A   4.0
1     2    B   5.5
2     3    C   6.6

In [56]:
df.shape

(3, 3)

Adding new col

In [57]:
df.insert(1, 'new_col', [5, 'D', 6.9])

In [58]:
df.shape

(3, 4)

Remove new column

In [59]:
df.drop("new_col", axis=1)

   col1 col2  col3
0     1    A   4.0
1     2    B   5.5
2     3    C   6.6

In [60]:
df.shape

(3, 4)

In [61]:
del df["new_col"]

In [64]:
df.shape

(4, 3)

Adding ROW

In [65]:
df.loc[3] = [4, 'D', 7.6] 
df

   col1 col2  col3
0     1    A   4.0
1     2    B   5.5
2     3    C   6.6
3     4    D   7.6

In [66]:
df.tail(3)

   col1 col2  col3
1     2    B   5.5
2     3    C   6.6
3     4    D   7.6

### Question 3

Question: Return the minimum and maximum of a Series `x` as a new Series with the index `["min", "max"]`.

Answer:

In [67]:
x=pd.Series([1, 2, 3, 4, 5, 6,7,8,9])
x

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [68]:
pd.Series([x.min(), x.max()], index=["min", "max"])

min    1
max    9
dtype: int64

Question 4

Question: Multiply df1 and df2 (two DataFrames) with a fill_value of 1.

Answer:

In [75]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [73]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [80]:
df1.multiply(df2, fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0  30.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

Question 5
Question: How do you create a DataFrame from a nested dictionary of dictionaries?

nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

In [81]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

In [89]:
df = pd.DataFrame.from_dict(nested_dict, orient='index')
df

   a  b
A  1  2
B  3  4

In [86]:
df = pd.DataFrame(nested_dict)
df

   A  B
a  1  3
b  2  4